// src/pages/About.js
import React from 'react';

function About() {
  return (
    <div>
      <h1>เกี่ยวกับเรา</h1>
      <p>วิทยาลัยเทคโนโลยีโปลิเทคนิคลานนา เชียงใหม่ (Lanna Polytechnic ChiangMai) ตั้งอยู่ที่ 2 ถนนสุขเกษม ตำบล ป่าตัน อำเภอ เมือง จังหวัด เชียงใหม่ เปิดสอนตั้งแต่ปี พ.ศ. 2521 โดยมีวัตถุประสงค์เพื่อส่งเสริมการศึกษา ด้านวิชาชีพแก่เยาวชนในภาคเหนือ</p>

      <h2>ประวัติสำคัญ</h2>
      <ul>
        <li><strong>2521:</strong> ก่อตั้งวิทยาลัยได้รับอนุญาตจากกระทรวงศึกษาธิการ</li>
        <li><strong>2527:</strong> เปิดสอนหลักสูตรประกาศนียบัตรวิชาชีพชั้นสูง (ปวส.) และขยายพื้นที่เป็น 35 ไร่</li>
        <li><strong>2529:</strong> เปิดสอนสาขาวิชาช่างอิเล็กทรอนิกส์และเพิ่มจำนวนสาขาวิชาช่างอุตสาหกรรม</li>
        <li><strong>2545:</strong> เปิดสอนหลักสูตรพาณิชยการและบริหารธุรกิจ</li>
        <li><strong>ปัจจุบัน:</strong> วิทยาลัยมีพื้นที่ 35 ไร่ มีนักศึกษากว่า 4,800 คน และเปิดสอนในหลายสาขาวิชา เช่น อุตสาหกรรม การพาณิชยกรรม และการท่องเที่ยว</li>
      </ul>

      <h3>วิสัยทัศน์</h3>
      <p>วิทยาลัยมีเป้าหมายในการพัฒนาความรู้และทักษะของนักศึกษา เพื่อให้มีความพร้อมในการเข้าสู่ตลาดแรงงานอย่างมืออาชีพ</p>
    </div>
  );
}

export default About;
